f1-wing-case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Note: this file is a Copy of $FOAM_TUTORIALS/resources/blockMeshDict
// ************************************************************************* //
convertToMeters 1.0;

vertices (
    (-5 -5 -1)   // 0
    (15 -5 -1)   // 1
    (15  5 -1)   // 2
    (-5  5 -1)   // 3
    (-5 -5  1)   // 4
    (15 -5  1)   // 5
    (15  5  1)   // 6
    (-5  5  1)   // 7
);

blocks (
    hex (0 1 2 3 4 5 6 7) (80 80 40) simpleGrading (1 1 1)
);

edges (
);

patches (
    patch inlet
    (
        (0 4 7 3)
    )
    patch outlet
    (
        (1 2 6 5)
    )
    patch sides
    (
        (0 1 5 4)
        (3 7 6 2)
    )
    patch topBottom
    (
        (4 5 6 7)
        (0 3 2 1)
    )
);

mergePatchPairs (
);
