f1-wing-case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (50 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (50 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    topBottom
    {
        type            slip;
    }

    sides
    {
        type            slip;
    }

    wing
    {
        type           noSlip;
    }
}


// ************************************************************************* //
